#### Terraform Format and Style 🖌`success`

<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_s3_bucket.codepipeline_bucket,
  on s3.tf line 1, in resource "aws_s3_bucket" "codepipeline_bucket":
   1: resource "aws_s3_bucket" "codepipeline_bucket" {

Use the aws_s3_bucket_logging resource instead
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.stacks_platform: Reading...
data.terraform_remote_state.stacks: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
data.terraform_remote_state.stacks_platform: Read complete after 0s
data.terraform_remote_state.stacks: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_codedeploy_app.ansible will be created
  + resource "aws_codedeploy_app" "ansible" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "Server"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "ansible-app-dev"
      + tags_all            = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "ansible-server"
          + "StackPath"      = "/stacks/platform/ansible-server"
        }
    }

  # aws_codedeploy_deployment_config.ansible will be created
  + resource "aws_codedeploy_deployment_config" "ansible" {
      + compute_platform       = "Server"
      + deployment_config_id   = (known after apply)
      + deployment_config_name = "ansible-deployment-config-dev"
      + id                     = (known after apply)

      + minimum_healthy_hosts {
          + type  = "HOST_COUNT"
          + value = 0
        }
    }

  # aws_codedeploy_deployment_group.ansible will be created
  + resource "aws_codedeploy_deployment_group" "ansible" {
      + app_name               = "ansible-app-dev"
      + arn                    = (known after apply)
      + compute_platform       = (known after apply)
      + deployment_config_name = (known after apply)
      + deployment_group_id    = (known after apply)
      + deployment_group_name  = "ansible-group-dev"
      + id                     = (known after apply)
      + service_role_arn       = (known after apply)
      + tags_all               = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "ansible-server"
          + "StackPath"      = "/stacks/platform/ansible-server"
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout    = (known after apply)
              + wait_time_in_minutes = (known after apply)
            }

          + green_fleet_provisioning_option {
              + action = (known after apply)
            }

          + terminate_blue_instances_on_deployment_success {
              + action                           = (known after apply)
              + termination_wait_time_in_minutes = (known after apply)
            }
        }

      + ec2_tag_set {
          + ec2_tag_filter {
              + key   = "App"
              + type  = "KEY_AND_VALUE"
              + value = "ansible-dev"
            }
        }
    }

  # aws_codepipeline.codepipeline will be created
  + resource "aws_codepipeline" "codepipeline" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ansible-deploy-pipeline-dev"
      + role_arn = (known after apply)
      + tags_all = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "ansible-server"
          + "StackPath"      = "/stacks/platform/ansible-server"
        }

      + artifact_store {
          + location = "codepipeline-ansible-ktech-br-dev"
          + region   = (known after apply)
          + type     = "S3"

          + encryption_key {
              + id   = (known after apply)
              + type = "KMS"
            }
        }

      + stage {
          + name = "Source"

          + action {
              + category         = "Source"
              + configuration    = {
                  + "PollForSourceChanges" = "true"
                  + "S3Bucket"             = "codepipeline-ansible-ktech-br-dev"
                  + "S3ObjectKey"          = "deploy/ansible.zip"
                }
              + name             = "S3_Source"
              + output_artifacts = [
                  + "source_output",
                ]
              + owner            = "AWS"
              + provider         = "S3"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Deploy"

          + action {
              + category        = "Deploy"
              + configuration   = {
                  + "ApplicationName"     = "ansible-app-dev"
                  + "DeploymentGroupName" = "ansible-group-dev"
                }
              + input_artifacts = [
                  + "source_output",
                ]
              + name            = "Deploy"
              + owner           = "AWS"
              + provider        = "CodeDeploy"
              + region          = (known after apply)
              + run_order       = (known after apply)
              + version         = "1"
            }
        }
    }

  # aws_iam_instance_profile.ansible_ec2_profile will be created
  + resource "aws_iam_instance_profile" "ansible_ec2_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ec2_ansible_profile-dev"
      + path        = "/"
      + role        = "ec2_ansible_role-dev"
      + tags_all    = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "ansible-server"
          + "StackPath"      = "/stacks/platform/ansible-server"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_openid_connect_provider.github_actions will be created
  + resource "aws_iam_openid_connect_provider" "github_actions" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "ansible-server"
          + "StackPath"      = "/stacks/platform/ansible-server"
        }
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_role.ansible_ec2_role will be created
  + resource "aws_iam_role" "ansible_ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2_ansible_role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "ansible-server"
          + "StackPath"      = "/stacks/platform/ansible-server"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.codedeploy_role will be created
  + resource "aws_iam_role" "codedeploy_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ansible_codedeploy_role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "ansible-server"
          + "StackPath"      = "/stacks/platform/ansible-server"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.codepipeline_role will be created
  + resource "aws_iam_role" "codepipeline_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codepipeline.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codepipeline_ansible_role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "ansible-server"
          + "StackPath"      = "/stacks/platform/ansible-server"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github_ansible_role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "ansible-server"
          + "StackPath"      = "/stacks/platform/ansible-server"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.ansible_ec2_policy will be created
  + resource "aws_iam_role_policy" "ansible_ec2_policy" {
      + id     = (known after apply)
      + name   = "ec2_ansible_policy-dev"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_iam_role_policy.ansible_ec2_policy_inventory will be created
  + resource "aws_iam_role_policy" "ansible_ec2_policy_inventory" {
      + id     = (known after apply)
      + name   = "ec2_ansible_policy_inventory-dev"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.codepipeline_policy will be created
  + resource "aws_iam_role_policy" "codepipeline_policy" {
      + id     = (known after apply)
      + name   = "codepipeline_policy-dev"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_iam_role_policy.github_policy will be created
  + resource "aws_iam_role_policy" "github_policy" {
      + id     = (known after apply)
      + name   = "github_ansible_policy-dev"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.AWSCodeDeployRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSCodeDeployRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRole"
      + role       = "ansible_codedeploy_role-dev"
    }

  # aws_kms_alias.key_alias will be created
  + resource "aws_kms_alias" "key_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/ansible-bucket-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.ansible_bucket_key will be created
  + resource "aws_kms_key" "ansible_bucket_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "This key is used to encrypt bucket objects"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "ansible-server"
          + "StackPath"      = "/stacks/platform/ansible-server"
        }
    }

  # aws_route53_record.ansible_private will be created
  + resource "aws_route53_record" "ansible_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ansible.[null]"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = jsonencode(
            [
              + null,
            ]
        )
    }

  # aws_s3_bucket.codepipeline_bucket will be created
  + resource "aws_s3_bucket" "codepipeline_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "codepipeline-ansible-ktech-br-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "ansible-server"
          + "StackPath"      = "/stacks/platform/ansible-server"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = "codepipeline-ansible-ktech-br-dev"
          + target_prefix = "bucket-access-log/codepipeline-ansible-ktech-br-dev"
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_acl.codepipeline_bucket will be created
  + resource "aws_s3_bucket_acl" "codepipeline_bucket" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_ownership_controls.codepipeline_bucket will be created
  + resource "aws_s3_bucket_ownership_controls" "codepipeline_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_public_access_block.block will be created
  + resource "aws_s3_bucket_public_access_block" "block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.codepipeline_bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "codepipeline_bucket" {
      + bucket = "codepipeline-ansible-ktech-br-dev"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.codepipeline_bucket will be created
  + resource "aws_s3_bucket_versioning" "codepipeline_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_security_group.egress_ping will be created
  + resource "aws_security_group" "egress_ping" {
      + arn                    = (known after apply)
      + description            = "Permit egress ping outbound to ansible in env: dev"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow ICMP in egress just to attach this rule to default ingress in others instances"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ansible_egress_ping-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ping"
        }
      + tags_all               = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "ping"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "ansible-server"
          + "StackPath"      = "/stacks/platform/ansible-server"
        }
      + vpc_id                 = jsonencode(
            [
              + null,
            ]
        )
    }

  # module.ec2-instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = jsonencode(
            [
              + null,
            ]
        )
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = jsonencode(
            [
              + null,
            ]
        )
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-aws-dev"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = jsonencode(
            [
              + null,
            ]
        )
      + tags                                 = {
          + "App"  = "ansible-dev"
          + "Name" = "ansible-server01-dev"
          + "Type" = "t3.small"
        }
      + tags_all                             = {
          + "App"            = "ansible-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "ansible-server01-dev"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "ansible-server"
          + "StackPath"      = "/stacks/platform/ansible-server"
          + "Type"           = "t3.small"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "ansible-server01-dev"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

Plan: 26 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.codepipeline_bucket,
  on s3.tf line 1, in resource "aws_s3_bucket" "codepipeline_bucket":
   1: resource "aws_s3_bucket" "codepipeline_bucket" {

Use the aws_s3_bucket_logging resource instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @kaio6fellipe, Action: `pull_request`, Workflow: `Terraform plan`*